package oop.class_and_Object;

public class Box {
    // Змінні, що записані в тілі класу називаються поля класу (class fields) вони є атребутами (властивостями) класу.
        // Поля класу описують стан об'єкта класу.
    double length;
    double width;
    double height;

    // Метод класу проводить операції (дії) з полями класу.
    double Volume () {
        return length * width * height;
    }

} // Клас "Box"
  // Клас - це логічний "шаблон" або "схема".
  // Клас повинен включати тільки ті поля і методи які безпосередньо стосуються об'єктів цього класу.
  // Об'єкт - це "втілення" класу, тобто реальна річ.