package loops;

public class For {
    public static void main(String[] args) {
//        for з фігурними дужками
        for (int i = 0; i <= 10; i++) { // 1-й блок (int i = 0) виконується 1 раз
                                        // 2-й блок (i <= 10) виконується кожного разу і перевіряє умову,
                                        //     яка в ньому закладена
                                        // 3-й блок (i++) виконується по закінченню 4-го блоку
            System.out.print(i+ "; ");  // 4-й блок (весь код що знаходиться між {}) виконується якщо 2-й блок True
        }                               // якщо 2-й блок False, то програма йде далі

//        з нової стрічки
        System.out.print("\n");

//        for без фігурних дужок
        for (int i = 0; i <= 10; i+=2) System.out.print(i+ "; ");
    }
}