package variables;

public class Final {
    // Імена констант пишуться в верхньому регістрі, між словами ставиться нижнє підкреслення.
    // Ініціалізація (присвоєння значення) константи - варіант 1 (при оголошенні поля)
    public final int MIN_WIDTH = 15;

    // Ініціалізація (присвоєння значення) константи - варіант 2 (в конструкторі)
    private final int MAX_WIDTH;

    public Final() {
        this.MAX_WIDTH = 25;
    }


// змінити константу вході виконання програми неможливо
//        MIN_WIDTH = 15;


    public static void main(String[] args) {
// оголошення змінної
        int x = 15;

// змінну можливо змінити вході виконання програми
        x = 25;
    }
}